
#Область ПрограммныйИнтерфейс

// Код процедур и функций

// Возвращает ссылку на авторизованного пользователя
// 
// Возвращаемое значение:
//СправочникСсылка.Пользователи - Текущий пользователь 
Функция ТекущийПользователь() Экспорт
	Возврат ПараметрыСеанса.ПА_ТекущийПользователь;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
